
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>DNS · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Что происходит когда пользователь открывает веб-страницу
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    DNS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    Сокеты
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="03.html">
            
                <a href="03.html">
            
                    
                    TLS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="04.html">
            
                <a href="04.html">
            
                    
                    HTTP
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >DNS</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;-dns">&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435; DNS</h1>
<ul>
<li>&#x411;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x430; &#x432; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43A;&#x44D;&#x448;&#x435;.</li>
<li>&#x415;&#x441;&#x43B;&#x438; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x430; &#x442;&#x430;&#x43C; &#x43D;&#x435;&#x442;, &#x442;&#x43E; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x447;&#x43D;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; gethostbyname (&#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x41E;&#x421;) &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;.</li>
<li>&#x41F;&#x440;&#x435;&#x436;&#x434;&#x435;, &#x447;&#x435;&#x43C; &#x438;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x434;&#x43E;&#x43C;&#x435;&#x43D; &#x43F;&#x43E; DNS gethostbyname &#x43F;&#x44B;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x444;&#x430;&#x439;&#x43B;&#x435; hosts (&#x435;&#x433;&#x43E; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x41E;&#x421;).</li>
<li>&#x415;&#x441;&#x43B;&#x438; &#x434;&#x43E;&#x43C;&#x435;&#x43D; &#x43D;&#x438;&#x433;&#x434;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43A;&#x44D;&#x448;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x438; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x432; &#x444;&#x430;&#x439;&#x43B;&#x435; hosts, gethostbyname &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43A; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x43C;&#x443; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443;. &#x41A;&#x430;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x44D;&#x442;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440; &#x438;&#x43B;&#x438; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;-&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x430;.</li>
<li>&#x415;&#x441;&#x43B;&#x438; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x438;, &#x442;&#x43E; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443;.</li>
<li>&#x415;&#x441;&#x43B;&#x438; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x438;, &#x442;&#x43E; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; IP-&#x430;&#x434;&#x440;&#x435;&#x441; &#x448;&#x43B;&#x44E;&#x437;&#x430; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E; (default gateway).</li>
</ul>
<h2 id="&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;-&#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438;-arp-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;">&#x41F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;</h2>
<p>&#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x435;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43E;&#x442;&#x44B;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x446;&#x435;&#x43B;&#x435;&#x432;&#x43E;&#x439; IP-&#x430;&#x434;&#x440;&#x435;&#x441;, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x442;&#x44C; MAC-&#x430;&#x434;&#x440;&#x435;&#x441; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;.</p>
<p>&#x41A;&#x44D;&#x448; ARP &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x446;&#x435;&#x43B;&#x435;&#x432;&#x43E;&#x433;&#x43E; IP-&#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x2014; &#x435;&#x441;&#x43B;&#x438; &#x430;&#x434;&#x440;&#x435;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x432; &#x43A;&#x44D;&#x448;&#x435;, &#x442;&#x43E; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x447;&#x43D;&#x430;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;: Target IP = MAC.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x436;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x438; &#x432; &#x43A;&#x44D;&#x448;&#x435; &#x43D;&#x435;&#x442;:</p>
<ul>
<li>&#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x430; &#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x2014; &#x44D;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x435;&#x441;&#x442;&#x44C; &#x43B;&#x438; &#x438;&#x441;&#x43A;&#x43E;&#x43C;&#x44B;&#x439; IP-&#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x43B;&#x438;&#x431;&#x43E; &#x438;&#x437; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x435;&#x439; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44B;. &#x415;&#x441;&#x43B;&#x438; &#x43E;&#x43D; &#x442;&#x430;&#x43C;, &#x442;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43F;&#x43E;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;, &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x441; &#x44D;&#x442;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x44C;&#x44E;. &#x415;&#x441;&#x43B;&#x438; &#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x435; &#x43D;&#x435; &#x43E;&#x431;&#x43D;&#x430;&#x440;&#x443;&#x436;&#x435;&#x43D;, &#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x438; &#x448;&#x43B;&#x44E;&#x437;&#x430; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;.</li>
<li>&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; MAC-&#x430;&#x434;&#x440;&#x435;&#x441; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;.</li>
<li>&#x41E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; (&#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x443;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x44C; &#x441;&#x442;&#x435;&#x43A;&#x430;):</li>
</ul>
<p>ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;:</p>
<p>Sender MAC: interface:mac:address:here
Sender IP: interface.ip.goes.here
Target MAC: FF:FF:FF:FF:FF:FF (Broadcast)
Target IP: target.ip.goes.here</p>
<p>&#x412; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x430;&#x43A;&#x43E;&#x435; &#xAB;&#x436;&#x435;&#x43B;&#x435;&#x437;&#x43E;&#xBB; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43E; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x43E;&#x43C; &#x438; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440;&#x43E;&#x43C; (&#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;):</p>
<p>&#x41F;&#x440;&#x44F;&#x43C;&#x43E;&#x435; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435;:</p>
<ul>
<li>&#x415;&#x441;&#x43B;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440; &#x43D;&#x430;&#x43F;&#x440;&#x44F;&#x43C;&#x443;&#x44E; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D; &#x43A; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440;&#x443;, &#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; ARP-&#x43E;&#x442;&#x432;&#x435;&#x442; (ARP Reply).</li>
</ul>
<p>&#x41C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43D;&#x442;&#x440;&#x430;&#x442;&#x43E;&#x440; (&#x425;&#x430;&#x431;):</p>
<ul>
<li>&#x415;&#x441;&#x43B;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D; &#x43A; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43D;&#x442;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443;, &#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x435;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x441;&#x43E; &#x432;&#x441;&#x435;&#x445; &#x441;&#x432;&#x43E;&#x438;&#x445; &#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;. &#x415;&#x441;&#x43B;&#x438; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D; &#x43F;&#x43E; &#x442;&#x43E;&#x43C;&#x443; &#x436;&#x435; &#xAB;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x443;&#xBB;, &#x442;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442; ARP-&#x43E;&#x442;&#x432;&#x435;&#x442;.</li>
</ul>
<p>&#x41C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43C;&#x43C;&#x443;&#x442;&#x430;&#x442;&#x43E;&#x440; (&#x441;&#x432;&#x438;&#x442;&#x447;):</p>
<ul>
<li>&#x415;&#x441;&#x43B;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x451;&#x43D; &#x441; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x43C; &#x43A;&#x43E;&#x43C;&#x43C;&#x443;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;, &#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x442; &#x441;&#x432;&#x438;&#x442;&#x447; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; CAM/MAC-&#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x443;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43F;&#x43E;&#x440;&#x442; &#x432; &#x43D;&#x435;&#x439; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x439; MAC-&#x430;&#x434;&#x440;&#x435;&#x441;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x432; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x435; &#x43D;&#x435;&#x442;, &#x442;&#x43E; &#x43E;&#x43D; &#x437;&#x430;&#x43D;&#x43E;&#x432;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x435;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x43C; &#x43F;&#x43E;&#x440;&#x442;&#x430;&#x43C;.</li>
<li>&#x415;&#x441;&#x43B;&#x438; &#x432; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x443;&#x436;&#x43D;&#x430;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x44C;, &#x442;&#x43E; &#x441;&#x432;&#x438;&#x442;&#x447; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43D;&#x430; &#x43F;&#x43E;&#x440;&#x442; &#x441; &#x438;&#x441;&#x43A;&#x43E;&#x43C;&#x44B;&#x43C; MAC-&#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x43C;.</li>
<li>&#x415;&#x441;&#x43B;&#x438; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440; &#xAB;&#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x43B;&#x438;&#x43D;&#x438;&#x438;&#xBB; &#x441;&#x43E; &#x441;&#x432;&#x438;&#x442;&#x447;&#x435;&#x43C;, &#x442;&#x43E; &#x43E;&#x43D; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x438;&#x442; (ARP Reply).</li>
</ul>
<p>ARP-&#x43E;&#x442;&#x432;&#x435;&#x442;:</p>
<p>Sender MAC: target:mac:address:here
Sender IP: target.ip.goes.here
Target MAC: interface:mac:address:here
Target IP: interface.ip.goes.here</p>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x443; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x439; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x435;&#x441;&#x442;&#x44C; IP-&#x430;&#x434;&#x440;&#x435;&#x441; &#x43B;&#x438;&#x431;&#x43E; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x43B;&#x438;&#x431;&#x43E; &#x448;&#x43B;&#x44E;&#x437;&#x430; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x438;:</p>
<ul>
<li>&#x41F;&#x43E;&#x440;&#x442; 53 &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; UDP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x43A; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443; (&#x435;&#x441;&#x43B;&#x438; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x432;&#x435;&#x43B;&#x438;&#x43A;, &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D; TCP).</li>
<li>&#x415;&#x441;&#x43B;&#x438; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x438;&#x43B;&#x438; &#x43D;&#x430; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x430; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#xAB;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x435;&#x442;&#xBB; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441;, &#x442;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x430;&#x448;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x438;&#x441;&#x43A;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43F;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x432;&#x44B;&#x448;&#x435;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x438;&#x445; DNS-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43E;&#x432;, &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x430; SOA-&#x437;&#x430;&#x43F;&#x438;&#x441;&#x44C;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Что происходит когда пользователь открывает веб-страницу">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: Сокеты">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"DNS","level":"1.2.1","depth":2,"next":{"title":"Сокеты","level":"1.2.2","depth":2,"path":"WHW/02.md","ref":"WHW/02.md","articles":[]},"previous":{"title":"Что происходит когда пользователь открывает веб-страницу","level":"1.2","depth":1,"path":"WHW/README.MD","ref":"WHW/README.MD","articles":[{"title":"DNS","level":"1.2.1","depth":2,"path":"WHW/01.md","ref":"WHW/01.md","articles":[]},{"title":"Сокеты","level":"1.2.2","depth":2,"path":"WHW/02.md","ref":"WHW/02.md","articles":[]},{"title":"TLS","level":"1.2.3","depth":2,"path":"WHW/03.md","ref":"WHW/03.md","articles":[]},{"title":"HTTP","level":"1.2.4","depth":2,"path":"WHW/04.md","ref":"WHW/04.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"WHW/01.md","mtime":"2019-08-04T13:37:16.854Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-04T13:38:05.628Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

