
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Сокеты · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03.html" />
    
    
    <link rel="prev" href="01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Что происходит когда пользователь открывает веб-страницу
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    DNS
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    Сокеты
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="03.html">
            
                <a href="03.html">
            
                    
                    TLS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="04.html">
            
                <a href="04.html">
            
                    
                    HTTP
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Сокеты</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435;-&#x441;&#x43E;&#x43A;&#x435;&#x442;&#x430;">&#x41E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x441;&#x43E;&#x43A;&#x435;&#x442;&#x430;</h1>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442; IP-&#x430;&#x434;&#x440;&#x435;&#x441; &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;, &#x442;&#x43E; &#x43E;&#x43D; &#x431;&#x435;&#x440;&#x451;&#x442; &#x44D;&#x442;&#x443; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43E;&#x431; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x43E;&#x43C; &#x43F;&#x43E;&#x440;&#x442;&#x435; &#x438;&#x437; URL (80 &#x43F;&#x43E;&#x440;&#x442; &#x434;&#x43B;&#x44F; HTTP, 443 &#x434;&#x43B;&#x44F; HTTPS) &#x438; &#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; socket &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x43E;&#x439; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x438; &#x437;&#x430;&#x43F;&#x440;&#x430;&#x448;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x442;&#x43E;&#x43A; TCP &#x441;&#x43E;&#x43A;&#x435;&#x442;&#x430; &#x2014; AF_INET &#x438; SOCK_STREAM.</p>
<ul>
<li>&#x42D;&#x442;&#x43E;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x443;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x44C;, &#x433;&#x434;&#x435; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; TCP-&#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;. &#x412; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x440;&#x442; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;, &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x440;&#x442; &#x432;&#x44B;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x437; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x443;&#x43B;&#x430; &#x44F;&#x434;&#x440;&#x430; (ip_local_port_range &#x432; Linux).</li>
<li>&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x432;&#x448;&#x438;&#x439;&#x441;&#x44F; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x439; &#x443;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x44C;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; IP-&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442;&#x441;&#x44F; IP-&#x430;&#x434;&#x440;&#x435;&#x441; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x430;&#x434;&#x440;&#x435;&#x441; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x44B; &#x2014; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x441;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;.</li>
<li>&#x41F;&#x430;&#x43A;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x443;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x44C;. &#x414;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A; &#x43A;&#x430;&#x434;&#x440;&#x430;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x439; MAC-&#x430;&#x434;&#x440;&#x435;&#x441; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x439; &#x43A;&#x430;&#x440;&#x442;&#x44B; (NIC) &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x430;, &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; MAC-&#x430;&#x434;&#x440;&#x435;&#x441; &#x448;&#x43B;&#x44E;&#x437;&#x430; (&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440;&#x430;). &#x41A;&#x430;&#x43A; &#x438; &#x43D;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x438;&#x445; &#x44D;&#x442;&#x430;&#x43F;&#x430;&#x445;, &#x435;&#x441;&#x43B;&#x438; &#x44F;&#x434;&#x440;&#x443; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x43E; &#x43E; MAC-&#x430;&#x434;&#x440;&#x435;&#x441;&#x435; &#x448;&#x43B;&#x44E;&#x437;&#x430;, &#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x435;&#x433;&#x43E; &#x43D;&#x430;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x432;&#x435;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; ARP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;.</li>
</ul>
<p>&#x41D;&#x430; &#x44D;&#x442;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x435; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x433;&#x43E;&#x442;&#x43E;&#x432; &#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437;:</p>
<ul>
<li>Ethernet</li>
<li>WiFi</li>
<li>&#x41F;&#x43E; &#x441;&#x43E;&#x442;&#x43E;&#x432;&#x43E;&#x439; &#x441;&#x432;&#x44F;&#x437;&#x438;</li>
</ul>
<p>&#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;-&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x438;&#x43B;&#x438; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D; &#x441; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x430;, &#x447;&#x435;&#x440;&#x435;&#x437; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x441;&#x435;&#x442;&#x44C;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x43E;&#x434;&#x435;&#x43C; (MOdulator/DEModulator), &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43B;&#x438;&#x440;&#x443;&#x435;&#x442; &#x446;&#x438;&#x444;&#x440;&#x43E;&#x432;&#x44B;&#x435; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44B; &#x438; &#x43D;&#x443;&#x43B;&#x438; &#x432; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x43E;&#x432;&#x44B;&#x439; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;, &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x43F;&#x43E; &#x442;&#x435;&#x43B;&#x435;&#x444;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x43B;&#x438;&#x43D;&#x438;&#x438;, &#x43A;&#x430;&#x431;&#x435;&#x43B;&#x44E; &#x438;&#x43B;&#x438; &#x431;&#x435;&#x441;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x43D;&#x44B;&#x43C; &#x442;&#x435;&#x43B;&#x435;&#x444;&#x43E;&#x43D;&#x43D;&#x44B;&#x43C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x43C;. &#x41D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x435; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x43C;&#x43E;&#x434;&#x435;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x43E;&#x432;&#x44B;&#x439; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B; &#x432; &#x446;&#x438;&#x444;&#x440;&#x43E;&#x432;&#x44B;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442; &#x438;&#x445; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x43C;&#x443; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x443;&#x437;&#x43B;&#x443;, &#x433;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x438;&#x439; &#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43E;&#x431; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x435; &#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x435;.</p>
<p>&#x412; &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;&#x43C; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x434;&#x43E;&#x431;&#x435;&#x440;&#x451;&#x442;&#x441;&#x44F; &#x434;&#x43E; &#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x441;&#x435;&#x442;&#x44C;&#x44E;. &#x417;&#x430;&#x442;&#x435;&#x43C; &#x43E;&#x43D; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x438;&#x442; &#x43F;&#x443;&#x442;&#x435;&#x448;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x442; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440;&#x430; &#x43A; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443;, &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x434;&#x43E;&#x431;&#x435;&#x440;&#x451;&#x442;&#x441;&#x44F; &#x434;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440; &#x43D;&#x430; &#x43F;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x437;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x442;&#x44C; &#x430;&#x434;&#x440;&#x435;&#x441; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x437; IP-&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x430; &#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x43D;&#x430; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x445;&#x43E;&#x43F;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; TTL (time to live) &#x432; IP-&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440;&#x430;. &#x415;&#x441;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; TTL &#x434;&#x43E;&#x441;&#x442;&#x438;&#x433;&#x43D;&#x435;&#x442; &#x43D;&#x443;&#x43B;&#x44F;, &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x442;&#x431;&#x440;&#x43E;&#x448;&#x435;&#x43D; (&#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x439;&#x434;&#x451;&#x442; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x435;&#x441;&#x43B;&#x438; &#x443; &#x43C;&#x430;&#x440;&#x448;&#x440;&#x443;&#x442;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x432; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x438; &#x2014; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x438;&#x437;-&#x437;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x441;&#x435;&#x442;&#x438;).</p>
<p>&#x412;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; TCP-&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x43E;&#x432;.</p>
<h2 id="&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439;-&#x446;&#x438;&#x43A;&#x43B;-tcp-&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;">&#x416;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x446;&#x438;&#x43A;&#x43B; TCP-&#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;</h2>
<p><strong>a. &#x41A;&#x43B;&#x438;&#x435;&#x43D;&#x442; &#x432;&#x44B;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; (ISN) &#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443; &#x441; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x431;&#x438;&#x442;&#x43E;&#x43C; SYN &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x44F; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;.</strong></p>
<p><strong>b. &#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442; &#x43F;&#x430;&#x43A;&#x435;&#x442; &#x441; &#x431;&#x438;&#x442;&#x43E;&#x43C; SYN &#x438;, &#x435;&#x441;&#x43B;&#x438; &#x433;&#x43E;&#x442;&#x43E;&#x432; &#x43A; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44E; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x442;&#x43E;:</strong></p>
<ul>
<li>&#x412;&#x44B;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;;</li>
<li>&#x423;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442; SYN-&#x431;&#x438;&#x442;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x438;&#x442;&#x44C; &#x43E; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;;</li>
<li>&#x41A;&#x43E;&#x43F;&#x438;&#x440;&#x443;&#x435;&#x442; ISN &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x430; +1 &#x432; &#x43F;&#x43E;&#x43B;&#x435; ACK &#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; ACK-&#x444;&#x43B;&#x430;&#x433; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;.</li>
</ul>
<p><strong>c. &#x41A;&#x43B;&#x438;&#x435;&#x43D;&#x442; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x435;&#x442; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x443;&#x442;&#x451;&#x43C; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;:</strong></p>
<ul>
<li>&#x423;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;;</li>
<li>&#x423;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;;</li>
<li>&#x423;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x435; ACK.</li>
</ul>
<p><strong>d. &#x414;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</strong></p>
<ul>
<li>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x434;&#x43D;&#x430; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x430; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; N &#x431;&#x430;&#x439;&#x442;&#x43E;&#x432;, &#x442;&#x43E; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; SEQ &#x43D;&#x430; &#x44D;&#x442;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;.</li>
<li>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430; (&#x438;&#x43B;&#x438; &#x446;&#x435;&#x43F;&#x43E;&#x447;&#x43A;&#x438; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x43E;&#x432;), &#x43E;&#x43D;&#x430; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x430;&#x43A;&#x435;&#x442; ACK, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; ACK &#x440;&#x430;&#x432;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x439; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</li>
</ul>
<p><strong>e. &#x417;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;:</strong></p>
<ul>
<li>&#x421;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435;, &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x430;&#x43A;&#x435;&#x442; FIN;</li>
<li>&#x414;&#x440;&#x443;&#x433;&#x430;&#x44F; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x435;&#x442; FIN (&#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; ACK) &#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; FIN-&#x43F;&#x430;&#x43A;&#x435;&#x442;;</li>
<li>&#x418;&#x43D;&#x438;&#x446;&#x438;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; FIN &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x43E;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; ACK.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01.html" class="navigation navigation-prev " aria-label="Previous page: DNS">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="03.html" class="navigation navigation-next " aria-label="Next page: TLS">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Сокеты","level":"1.2.2","depth":2,"next":{"title":"TLS","level":"1.2.3","depth":2,"path":"WHW/03.md","ref":"WHW/03.md","articles":[]},"previous":{"title":"DNS","level":"1.2.1","depth":2,"path":"WHW/01.md","ref":"WHW/01.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"WHW/02.md","mtime":"2019-08-04T13:37:16.854Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-04T13:38:05.628Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

