
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>HTTP · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Что происходит когда пользователь открывает веб-страницу
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    DNS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    Сокеты
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="03.html">
            
                <a href="03.html">
            
                    
                    TLS
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="04.html">
            
                <a href="04.html">
            
                    
                    HTTP
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >HTTP</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;-http">&#x41F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B; HTTP</h1>
<p>&#x415;&#x441;&#x43B;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x439; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x431;&#x44B;&#x43B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D; Google, &#x442;&#x43E; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; HTTP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;, &#x43E;&#x43D; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#xAB;&#x434;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F;&#xBB; &#x441; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43E;&#x43C; &#x43E;&#x431; &#xAB;&#x430;&#x43F;&#x433;&#x440;&#x435;&#x439;&#x434;&#x435;&#xBB; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x430; &#x441; HTTP &#x434;&#x43E; SPDY (&#xAB;&#x441;&#x43F;&#x438;&#x434;&#x438;&#xBB;).</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; HTTP-&#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B; &#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; SPDY, &#x442;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;:</p>
<pre><code class="lang-ini">GET / HTTP/1.1
Host: google.com
Connection: close
[&#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438;]
</code></pre>
<p>&#x433;&#x434;&#x435; [&#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438;] &#x2014; &#x44D;&#x442;&#x43E; &#x441;&#x435;&#x440;&#x438;&#x44F; &#x43F;&#x430;&#x440; &#xAB;&#x43A;&#x43B;&#x44E;&#x447;: &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;&#xBB;, &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44B;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x43E;&#x441;&#x43E;&#x43C; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;. (&#x417;&#x434;&#x435;&#x441;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x43D;&#x435;&#x442; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445; &#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A;, &#x43D;&#x430;&#x440;&#x443;&#x448;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44E; HTTP. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; HTTP/1.1, &#x432; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43E;&#x43D; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43D;&#x435; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A; Host &#x432; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x438; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;, &#x43E;&#x442;&#x434;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x432; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43D;&#x430; GET-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; HTTP/1.0 &#x438;&#x43B;&#x438; HTTP/0.9).</p>
<p>HTTP/1.1 &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x43F;&#x446;&#x438;&#x44E; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x44F; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; (&#xAB;close&#xBB;) &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44F; &#x2014; &#x441; &#x435;&#x451; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43E; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x438; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;. &#x41A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;:</p>
<pre><code class="lang-ini">Connection: close
</code></pre>
<p>&#x41F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; HTTP/1.1, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x43D;&#x44B; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x438;&#x44E; &#xAB;close&#xBB; &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435;.</p>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x438; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x43E;&#x432;, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x443;&#x44E; &#x43F;&#x443;&#x441;&#x442;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443;, &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B;&#x43E;&#x441;&#x44C;.</p>
<p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x431;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x435;&#x442; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; &#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;:</p>
<pre><code class="lang-ini">200 OK
[&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;]
</code></pre>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x443;&#x441;&#x442;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x448;&#x438;&#x439;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442; HTML-&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; www.google.com. &#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435;, &#x438;&#x43B;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x442;&#x43E;&#x433;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438;, &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x43C; &#x434;&#x43B;&#x44F; &#x435;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C;&#x438; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;&#x43C;&#x438;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; HTTP-&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x43C; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x443; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x437;&#x430;&#x43A;&#x44D;&#x448;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x438; &#x44D;&#x442;&#x43E;&#x442; &#x444;&#x430;&#x439;&#x43B; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x44F;&#x43B;&#x441;&#x44F; &#x441;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;, &#x442;&#x43E; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x443;&#x44E; &#x444;&#x43E;&#x440;&#x43C;&#x443;:</p>
<pre><code class="lang-ini">304 Not Modified
[&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x430;]
</code></pre>
<p>&#x438;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x443; &#x43D;&#x435; &#x43F;&#x43E;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;, &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#xAB;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x451;&#x442;&#xBB; HTML &#x438;&#x437; &#x43A;&#x44D;&#x448;&#x430;.</p>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x440;&#x430;&#x437;&#x431;&#x43E;&#x440;&#x430; HTML, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; (&#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;) &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44F;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x430; (&#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x441;&#x442;&#x438;&#x43B;&#x438;, &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x44B;, favicon.ico &#x438; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x435;&#x435;), &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; HTML-&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;, &#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x434;&#x440;&#x435;&#x441; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; c GET / HTTP/1.1 &#x43D;&#x430; GET /$(&#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; URL &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x430; www.google.com) HTTP/1.1.</p>
<p>&#x415;&#x441;&#x43B;&#x438; HTML &#x441;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;, &#x440;&#x430;&#x437;&#x43C;&#x435;&#x449;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x435;, &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E;&#x43C; &#x43E;&#x442; google.com, &#x442;&#x43E; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x448;&#x430;&#x433;&#x430;&#x43C;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x438;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x437;&#x430;&#x43D;&#x43E;&#x432;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441; &#x434;&#x43E; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x443;&#x436;&#x435; &#x434;&#x43B;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x430;. &#x417;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A; Host &#x432; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x435; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; google.com &#x431;&#x443;&#x434;&#x435;&#x442; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D; &#x43D;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x435; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x438;&#x43C;&#x44F;.</p>
<h2 id="&#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430;-http-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;-&#x43D;&#x430;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435;">&#x41E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; HTTP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x43D;&#x430; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435;</h2>
<p>HTTPD (HTTP Daemon) &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x437; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;/&#x43E;&#x442;&#x432;&#x435;&#x442;&#x43E;&#x432; &#x43D;&#x430; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;. &#x41D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x44B;&#x435; HTTPD-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x44B; &#x44D;&#x442;&#x43E; Apache &#x438;&#x43B;&#x438; Nginx &#x434;&#x43B;&#x44F; Linux &#x438; IIS &#x434;&#x43B;&#x44F; Windows.</p>
<ul>
<li><p>HTTPD (HTTP Daemon) &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;.</p>
</li>
<li><p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43F;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;:</p>
<ul>
<li>&#x41C;&#x435;&#x442;&#x43E;&#x434; HTTP-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; (GET, HEAD, POST, PUT, PATCH, DELETE, CONNECT, OPTIONS &#x438;&#x43B;&#x438; TRACE). &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; URL-&#x430;&#x434;&#x440;&#x435;&#x441;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43D;&#x430;&#x43F;&#x435;&#x447;&#x430;&#x442;&#x430;&#x43B; &#x432; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;, &#x43C;&#x44B; &#x438;&#x43C;&#x435;&#x435;&#x43C; &#x434;&#x435;&#x43B;&#x43E; &#x441; GET-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x43C;.</li>
<li>&#x414;&#x43E;&#x43C;&#x435;&#x43D;. &#x412; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x2014; google.com.</li>
<li>&#x417;&#x430;&#x43F;&#x440;&#x430;&#x448;&#x438;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x43F;&#x443;&#x442;&#x438;/&#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;, &#x432; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x2014; / (&#x43D;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x443;&#x442;&#x435;&#x439;, / &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x443;&#x442;&#x44C; &#x43F;&#x43E; &#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;).</li>
</ul>
</li>
<li><p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x445;&#x43E;&#x441;&#x442;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; google.com.</p>
</li>
<li><p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442;, &#x447;&#x442;&#x43E; google.com &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C; GET-&#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x44B;.</p>
</li>
<li><p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442;, &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43B;&#x438; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442; &#x43F;&#x440;&#x430;&#x432;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x442; &#x43C;&#x435;&#x442;&#x43E;&#x434; (&#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; IP-&#x430;&#x434;&#x440;&#x435;&#x441;&#x430;, &#x430;&#x443;&#x442;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x438; &#x43F;&#x440;&#x43E;&#x447;&#x435;&#x435;).</p>
</li>
<li><p>&#x415;&#x441;&#x43B;&#x438; &#x43D;&#x430; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x438; (mod_rewrite &#x434;&#x43B;&#x44F; Apache &#x438;&#x43B;&#x438; URL Rewrite &#x434;&#x43B;&#x44F; IIS), &#x442;&#x43E; &#x43E;&#x43D; &#x441;&#x43E;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x441; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x437; &#x441;&#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x44E;&#x449;&#x435;&#x435; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x442;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x435;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;.</p>
</li>
<li><p>&#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x443;, &#x432; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43E;&#x43D; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442; &#x438;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43D;&#x44B;&#x439; &#x444;&#x430;&#x439;&#x43B;.</p>
</li>
<li><p>&#x414;&#x430;&#x43B;&#x435;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442; (&#xAB;&#x43F;&#x430;&#x440;&#x441;&#x438;&#x442;&#xBB;) &#x444;&#x430;&#x439;&#x43B; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;. &#x415;&#x441;&#x43B;&#x438; Google &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x430; PHP, &#x442;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; PHP &#x434;&#x43B;&#x44F; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x438; &#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x443;.</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: TLS">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"HTTP","level":"1.2.4","depth":2,"previous":{"title":"TLS","level":"1.2.3","depth":2,"path":"WHW/03.md","ref":"WHW/03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"WHW/04.md","mtime":"2019-08-04T14:00:14.877Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-04T14:01:02.307Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

